; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	instrument11 - instrument
	satellite6 - satellite
	instrument12 - instrument
	satellite7 - satellite
	instrument13 - instrument
	instrument14 - instrument
	instrument15 - instrument
	thermograph3 - mode
	image1 - mode
	spectrograph2 - mode
	infrared0 - mode
	image4 - mode
	Star5 - direction
	Star1 - direction
	Star4 - direction
	Star0 - direction
	Star3 - direction
	GroundStation2 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument1 image4)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star1)
	(supports instrument2 image1)
	(supports instrument2 image4)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument3 thermograph3)
	(supports instrument3 image4)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 Star3)
	(supports instrument4 image4)
	(supports instrument4 spectrograph2)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 Star4)
	(supports instrument5 thermograph3)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
	(supports instrument6 image1)
	(supports instrument6 image4)
	(supports instrument6 infrared0)
	(calibration_target instrument6 Star1)
	(calibration_target instrument6 Star5)
	(supports instrument7 infrared0)
	(supports instrument7 spectrograph2)
	(supports instrument7 image4)
	(calibration_target instrument7 Star3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
	(supports instrument8 spectrograph2)
	(calibration_target instrument8 Star5)
	(supports instrument9 image1)
	(calibration_target instrument9 Star5)
	(calibration_target instrument9 Star0)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon10)
	(supports instrument10 thermograph3)
	(supports instrument10 spectrograph2)
	(calibration_target instrument10 GroundStation2)
	(calibration_target instrument10 Star1)
	(supports instrument11 infrared0)
	(supports instrument11 image4)
	(calibration_target instrument11 Star5)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star1)
	(supports instrument12 image1)
	(calibration_target instrument12 Star4)
	(calibration_target instrument12 Star1)
	(on_board instrument12 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star3)
	(supports instrument13 image4)
	(supports instrument13 thermograph3)
	(calibration_target instrument13 Star0)
	(supports instrument14 infrared0)
	(calibration_target instrument14 Star3)
	(supports instrument15 image1)
	(supports instrument15 infrared0)
	(supports instrument15 spectrograph2)
	(calibration_target instrument15 GroundStation2)
	(on_board instrument13 satellite7)
	(on_board instrument14 satellite7)
	(on_board instrument15 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Star7)
)
(:goal (and
	(pointing satellite2 Star6)
	(pointing satellite5 Star5)
	(have_image Star6 thermograph3)
	(have_image Star7 thermograph3)
	(have_image Planet8 spectrograph2)
	(have_image Planet9 spectrograph2)
	(have_image Phenomenon10 image4)
	(have_image Planet11 infrared0)
))

)

; plan
1. (turn_to satellite2 star0 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 star0)
   goals met: 0 of 8
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 8
3. (calibrate satellite2 instrument5 star0)
   added: (calibrated instrument5)
   goals met: 0 of 8
4. (turn_to satellite2 star7 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star7)
   goals met: 0 of 8
5. (take_image satellite2 star7 instrument5 thermograph3)
   added: (have_image star7 thermograph3)
   goals met: 1 of 8
6. (turn_to satellite2 planet11 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 planet11)
   goals met: 1 of 8
7. (take_image satellite2 planet11 instrument5 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 2 of 8
8. (turn_to satellite2 star6 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 star6)
   goals met: 3 of 8
9. (take_image satellite2 star6 instrument5 thermograph3)
   added: (have_image star6 thermograph3)
   goals met: 4 of 8
10. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 4 of 8
11. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 4 of 8
12. (turn_to satellite1 phenomenon10 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon10)
   goals met: 4 of 8
13. (take_image satellite1 phenomenon10 instrument2 image4)
   added: (have_image phenomenon10 image4)
   goals met: 5 of 8
14. (turn_to satellite1 planet8 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet8)
   goals met: 5 of 8
15. (take_image satellite1 planet8 instrument2 spectrograph2)
   added: (have_image planet8 spectrograph2)
   goals met: 6 of 8
16. (turn_to satellite1 planet9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet9)
   goals met: 6 of 8
17. (take_image satellite1 planet9 instrument2 spectrograph2)
   added: (have_image planet9 spectrograph2)
   goals met: 7 of 8
18. (turn_to satellite5 star5 star1)
   deleted: (pointing satellite5 star1)
   added: (pointing satellite5 star5)
   goals met: 8 of 8
